// 여기선 db를 다루는 법을 배워볼거임
//db는 데이터베이스 database의 약자로 정보들을 반영구적으로 보존하는 곳을 의미함
//얘를들어 코드에서 let a 라고 해봤자 이 a에 저장된 정보들은 프로그램이 꺼지면 사라짐
//a에 저장된 정보는 대체 어디에 있길래 사라지느냐?
//바로 컴퓨터의 Ram(램)에 저장됨
//램이 크면 클수록 그만큼 프로그램을 많이 켜놓을 수 있는거

//각설하고, db는 어디에 놔두느냐? 자기 컴퓨터에다 만드는 방법이 있음
//근데 복잡하고 컴퓨터 자체가 날아가면 db도 폭발하는거
//그래서 db를 전문적인 회사에다가 놓는게 현명하겠지
//그걸 해주는 회사가 여러 회사가 있는데 하나가 mongodb임
//일단 무료라고 좋음. 그리고 no sql임
//sql을 안쓴다는 건데 sql이 뭐냐면 db 다룰때 쓰는 언어임
//db 쓴다고 언어 한개 더배우면 시간 ㅈㄴ 아깝잖음? mongodb는 sql을 안써서 좋다는 거임

//이제 mongodb를 쓰는 방법을 알려줄거임
//다시 말하지만 mongodb는 회사임. 우리가 이 회사에다가 db를 저장해달라고 요청하는 방법은 프로그래밍 언어를 쓰면 됨
//python , go , java, 등 여러가지 언어가 있지만 우리는 ts로 할거임. python으로 하는 방법도 나중에 알려줄게

//일단 nodejs(js돌려주는 프로그램이라 보면됨)에서 mongodb에 연결하려면 또 복잡함.
//근데 어떤 천재들이 mongodb에 연결할 수 있는 라이브러리를 만들어놨음
//우리는 이걸 갖다쓰기만 하면 됨. 라이브러리 이름은 mongoose (동물이름맞음)

//자 이 라이브러리 써보자~
import mongoose from "mongoose"

mongoose.connect("")
//여기서부턴 복잡하니까 내가 직접 설명해드림..