//안녕하세요 타입스크립트의 세계에 오신것을 환영합니다
//타입스크립트는 자바스크립트에서 타입+성능좋은기능들이 추가된거라 보면 됨

//그러나 자바스크립트와 달리 타입스크립트는 바로 실행할 수 없어요
//타입스크립트>자바스크립트로 번역하는 과정이 필요합니다, 결국엔 자바스크립트 코드인거죠
//그렇기 때문에 초반 세팅이 필요하므로 잘 외워두시기 바랍니다

/**
 * //2,3번은 이 폴더에선 이미 되어있어요. 이 폴더에선 1번과 4번만 해주시면 됩니다
 * 
 * 1st 타입스크립트를 깐다
 *  다음 명령어를 실행해주세요
 *  npm install typescript 
 *  또는 npm i typescript
 *  i는 install의 약자입니당
 * 
 * 2nd tsconfig.json을 생성한다
 *  tsconfig.json파일은 자스에서의 package.json이라고 보시면 됩니다
 *  이를 통해 타입스크립트의 여러 설정을 관리할수 있어요
 *  npx tsc --init < 명령어를 실행해주시면 자동으로 생겨요
 * 
 * 3rd tsconfig의 내용을 설정한다.
 *  이제 세팅을 해줄 차례입니다
 *  compileroption 위에 "include": ["src"],를 추가해주시고
 *  baseurl의 주석을 풀어 "baseUrl": "src", 라고 하시기 바랍니다
 *  이는 이제 타입스크립트가 src라는 폴더 안에 있는 것만 감시하겠다는 뜻입니다
 * 
 *  또한 outdir의 주석을 풀어 "outDir": "build",라고 하시기 바랍니다
 *  이는 ts가 바뀐 js파일들이 build라는 파일 안으로 들어감을 의미합니다
 * 
 * 4th 편한 기능인 watch를 추가한다
 *  원래는 ts에서 js로 바꾸는 과정에서 tsc라는 명령어를 일일히 쳐줘야합니다
 *  당연히 vscode에는 자동으로 js로 바꿔주는 기능이 존재합니다
 *  ctrl + shift + b < 치고 watch를 누르시면 자동으로 build 파일이 생기고 
 *  그 안에 번역된 js파일들이 생기는 것을 확인하실 수 있습니다.
 * 
 * 세팅은 마무리가 되었습니다! 이제 src 안에서 마음껏 ts코드를 만지시면 됩니당
 */
